package 연습;

public class StudentMain {

	public static void main(String[] args) {
		// Student 클래스
		// - name 이름
		// -subjects 과목명들
		// -score 과목별 점수들
		// 1. addScore 메서드: 과목과 해당 과목에 대한 점수를 추가해주는 메서드
		// 2. getTotalScore 메서드 : 전체 과목점수들에 대한 합계를 반환해주는 메서드
		// 3. getAverageScore 메서드 : 전체 과목점수 평균을 반환해주는 메서드
		// 생성자를 통해 학생의 이름을 전달받아 초기화되도록 구현
		// 과목들은 최대 10과목까지 등록가능
		
//		서점에 도서관리 프로그램 -직원시점
//		서점
//		==속성(필드 - 변수)==
//		이름, 전화번호 , 주소, 책들
//		
//		===기능들 (메서드)===
//		도서/이름/저자/장르/가격/출판사
//		-도서 등록
//		-도서 조회 (재고확인, 위치, 가격, 할인율)
//		-도서 삭제
//		-도서 판매
//		-판매 내역
	}

}
