package 상속;

public class Ex01 {

	public static void main(String[] args) {
		// 상속 => 다른 클래스한테 필드와 메서드를 물려주는거
		
//		학생, 회사원, 개발자 ,알바생 <- 공통적으로 가지고 있는 속성
//		사람이니까 나이, 이름, 성별 다 가지고 있음
//		다양한 직종의 사람들의 정보를 관리하는 시스템
//		기본적으로 이름, 나이 , 성별을 관리할거지만
//		학생은 다니는 학교와 학년 반도 저장을 할거고
//		회사원은 다니는 회사와 직급을 저장할거고
//		개발자는 주력 언어와 연봉을 저장할거고
//		알바생은 알바 장소와 알바 시간대를 저장하고싶다.

//		저것들은 클래스로 만들면 하나의 배열에 못담음 그래서 상속
		
		
//		사람 - 이름 나이 성별
//		그리고 나머지 학생, 회사원, 개발자, 알바생에게 사람에 들어가있는 속성을 물려줌
		
//		학생 extends 사람{} -> 사람이 가지고 있는 (이름,나이,성별)을 학생에게 물려줌
//		메서드 오버라이딩 
	}

}
